// 决心 信心 耐心


// 前段开发框架：vue2和vue3、react 16 和react17 ，angular1和2
// 小程序开发框架：微信原生小程序，uniapp兼容h5和微信小程序
// 脚手架工具：阿里的umi，还有cra,vue-cli
// 状态管理工具：react:dva、redux、mobx,vue：vueX,pinia
// 组件框架:antd ,antd-mobile,vant2,element-UI
// 基础：html5,css3,原生js， e6,e7 
// 构建工具：webpack5
// 熟悉:nodeJS,three.js，nvm ,nrm ,git,也会在npm调研插件，
// 在一家小公司工作两年，一家中型公司工作。这些只是中级前端的门槛

// 1 架构设计能力：可扩展、可维护的前端架构，理解微前端、服务端渲染（SSR）、渐进式 Web 应用（PWA）等高级架构模式
// 2 性能优化：码分割、懒加载、资源压缩、缓存策略等优化方法，研究网络优化技巧，如 HTTP/2、CDN 使用、DNS 预解析等
// 3 安全性：XSS、CSRF
// 4 工程化：了解前端自动化测试，如单元测试、集成测试、端到端测试
// 5 算法与数据结构：提升算法和数据结构的知识，这对于编写高效代码至关重要。参加在线编程挑战，如 LeetCode、HackerRank，以提高解决问题的能力
// 6 后端知识：Node.js
// 7 全栈能力：MySQL
// 8 持续学习:养成这种习惯

// 1、基础扎实，js的一些基本原理、浏览器机制，vue react 的封装思路不求很透彻，起码得了解，知道个大概其。
// http机制，接口的实现思路，sql怎么写，数据库表结构 这些可以不会，但是得了解。最后就是前端工程化，脚手架那么多，
// 不需要你手撸脚手架，但是得会用，会修改。
// 2、亮点，比如 webgl、大屏可视化、移动端app、跨平台的小程序、C端sass系统，这里面总得有一两个自己很熟的吧，经常做、
// 有经验，而且积累了一些东西，设计思路、复杂情况的解决方案，通用代码等等，都可以。
// 3、核心竞争力：行业。核心竞争力一定是行业，举个简单的例子，做电商app，就一直做电商类产品；做工业互联网，
// 就一直钻研工业互联网；做通讯类软件，就一直做类似产品。程序员是个很好找工作，跳槽频率也很高的工种，
// 但是大家好学并且都有5年工作经验之后，就会发现技术上遇到瓶颈了，可以学的东西很多，但是很难大幅提升自己的竞争力。
// 大家会的都差不多，可能各有一些特长，但是相差不大，找工作可能得靠降低薪水提升竞争力。


// 要学习的东西：
// git


// 收入统计：
// 2033 9.18 ： 3363  
// 2033 10.8 ： 7364
// 2033 11.8 ： 7364
// 2033 12.8 ： 7685
// 2024 1.8 ： 7685
// 2024 2.8 ： 6061 
// 2024 3.8 ： 8661 
// 2024 4.8 ： 9332 
// 2024 5.8 ： 9232 
// 2024 6.8 ： 9232 
// 2024 7.15 ： 9232  合计 85111

// 2024 7.18 ： 9232 
// 2024 8.18 ： 9232 
// 2024 9.18 ： 9232 
// 2024 10.18 ： 9232 
// 2024 11.18 ： 9232 
// 2024 12.18 ： 9232 
// 2025 1.18 ： 9232 
// 2025 2.18 ： 9232 
// 2025 3.18 ： 9232 

// 合计收入：85111 元

// 支出统计：
// 14000：剩余金额
// 10000：老妈那里
// 5000：过年来回飞机票钱
// 5000：我爹那里
// 4000：参加我大哥婚礼
// 4000：借出去的钱
// 33000：3000 * 11个月的生活费（按最多算包含房钱其他杂乱费）
// 3000:给好多人发的红包 200 200 200 200 188 188 188
// 合计：76000


// 4000万年前 天降青铜陨玉、青铜碎片
// 长生的秘密：是由丹药（尸蟞王丹） 并 进入陨玉完成的过程，在陨玉中，
// 这种环境可以中和尸蟞王丹的毒性，并让基因进行进化，直到数千年后尸蟞王死亡人便可以 实现长生
// 尸蟞出处： 在与青铜陨石有一些接触，受陨石辐射影响导致进化出毒性
// 尸蟞王丹的制作：尸蟞王 和 主要的成分 青铜碎片研磨成的粉末
// 尸蟞王丹为什么要放青铜粉末：这种青铜粉末会限制尸蟞王的毒性，最重要的是让尸蟞王释放毒素 
// 尸蟞王丹为什么要放尸蟞王：关键就在于 尸蟞王身上特殊的毒性
// 为什么必须进入陨玉：不进入就会变成禁婆，因为陨玉会限制尸蟞王分泌的毒素


// 当你模棱两可的时候我的心已经寒了一半了 你又找了一些奇葩理由，我已经放弃了，只不过放弃不止是一件事，还有某些人
// 不过本着我的规矩或则说原则，我再给我一次机会，也是给你一次机会。我让你说清为什么不借，没想到说清了又找了其他借口。再见了我的朋友


// 哪里有需求 哪里有交易





// 要学习的东西：
// vue react 的封装思路
// 前端工程化
// 微前端



// 要复习的东西：
// 那本书（复习大全）
// react 16/17
// vue 2/3
// nodeJS
// webpack 
// angular


// 学习计划：

// 嗔：仇恨 哀怨 厌恶

// 前端技能100道题 
// 或者说有没有学习些什么就可以有解决100道题的能力


// 否计划：
// 1 面试
    // 简历
    // 面试题
    // 笔试题
    // github仓库展示过去的项目
    // 了解公司
// 2 能力
    // 沟通能力
    // 加班能力 提前的心理准备  只要到20点前就可以
    // 持续学习能力
    // 适应能力

// 1625
// 42%  682.5
// 34%  552.5
// 24%  390